a = int(input(" Entrer un nombre entier de secondes : "))
b = int(a//60)

if a%60<60:
    x = a%60

c = int(a//3600)

if a%3600<3600:
    y = a%3600
  
d = int(a//(3600*24))

if a%3600*24<(3600*24):
    z = a%(3600*24)
    
f = int(a//(3600*24*30))


if a%3600*24*30<(3600*24*30):
    q = a%(3600*24*30)
    
g =int(a//(3600*24*12*30))

if a%3600*12*24<(3600*12*24*30):
    t = a%(3600*12*24*30)


s = t //(3600*24*30)
p = t%(3600*24*30) // (3600*24)
n = (t%(3600*24*30))%(3600*24) // 3600
l = ((t%(3600*24*30))%(3600*24)%3600) // 60
print("{} = {} année(s), {} mois, {} jours, {} heures et {} minutes et {} secondes".format(a,g,s,p,n,l,x))

